<?php
/**********************************************************
* File         : msg.inc.php
* Authors      : Mie Tsutsui
* Date         : 2008.06.21
* Last Update  : 2008.06.21
* Copyright    :
***********************************************************/

$cmnMsg = array(

// 共通メッセージ
  "E001"  => "{0}を入力してください",
  "E002"  => "{0}は半角数字で入力してください",
  "E003"  => "{0}は{1}以内で入力してください",
  "E004"  => "{0}は{1}で入力してください",
  "E005"  => "{0}が重複しています。同じ名前での登録はできません",
  "E006"  => "{0}を正しく入力してください",
  "E007"  => "{0}を選択してください",
  "E008"  => "{0}は両方入力してください",
  "E009"  => "{0}には正しい時間を入力してください",
  "E010"  => "{0}は{1}より前にしてください",
  "E011"  => "{0}は{1}より後にしてください",
  "E012"  => "{0}＜{1}になるように入力してください",
  "E013"  => "{0}に存在しない日が入力されています",
  "E014"  => "{0}はyyyy-mm-ddで入力してください",
  "E015"  => "{0}が画像ファイルではありません。",
  "E016"  => "{0}は０以上の数値で入力してください",
  "E017"  => "入力された{0}は既に使用されています。",
  "E018"  => "入力された{0}は既に登録されています。",
  "E019"  => "{0}に入力された「{1}」は電子カルテで使用できない文字です。代替文字を使用してください。",

  "E501"  => "パスワードとパスワード（確認）が一致しません。",
  "E502"  => "{0}の１文字目には数字、-（ハイフン）、.（ピリオド）は使用できません。",
  "E503"  => "{0}には.（ピリオド）を連続して使用することができません。",
  "E504"  => "{0}の末尾には.（ピリオド）は使用できません。",

  "E601"  => "状態が入力されていません。状態を入力するか削除ボタンで削除してください。",
  "E602"  => "終了判定の状態を一つ以上登録してください。",

  "P001"  => "入力された{0}は存在しません。",
  "P002"  => "{0}を登録できませんでした。",
  "P003"  => "{0}を削除できませんでした。",
  "P004"  => "{0}は別の資産種別で使用中です。",

  "F001"  => "許可されていないファイル形式です。",
  "F002"  => "既に同名のファイルがアップロードされています。",

  "F101"  => "CSVファイルをアップロードして下さい。",
  "F102"  => "CSVファイルを開けませんでした。",

  "C001"  => "{0}しました",
  "C002"  => "処理が完了しました。",
  "C003"  => "処理が完了しました。引き続き登録処理を行って下さい。",

  "E998"  => "処理に失敗しました",
  "E999"  => "データベースの更新に失敗しました",

  "L001"  => "IDまたはパスワードが間違っています",

  "D001" => "プリンタマッピングとして使用されているプリンタのため、ドライバ割り付けを解除できません。",
  "D002" => "プリンタマッピングとして使用されているプリンタのため、「仮想環境で利用する」を解除できません。",

) ;
?>