<?php
/**********************************************************
* File         : printGuests.php
* Authors      : sumio imoto
* Date         : 2013.05.21
* Last Update  : 2013.05.21
* Copyright    :
***********************************************************/

//=================================
// 共通処理
//=================================
// 処理プログラム
require_once("mod/guests_search.class.php");

//=================================
// メイン
//=================================

// モード設定
$_REQUEST["mode"] = "prePrint";

// 処理オブジェクト生成
$mgr = new guests_search($_REQUEST);

// 処理開始
$ret = $mgr->run();

// 終了
exit;

?>
