<?php
/**********************************************************
* File         : viewGuestPasswd.php
* Authors      : mie tsutsui
* Date         : 2013.01.29
* Last Update  : 2013.01.29
* Copyright    :
***********************************************************/

//=================================
// 共通処理
//=================================
// 処理プログラム
require_once("mod/guests_detail.class.php");

//=================================
// メイン
//=================================

// モード設定
$_REQUEST["mode"] = "viewGuestPasswd";

// 処理オブジェクト生成
$mgr = new guests_detail($_REQUEST);

// 処理開始
$ret = $mgr->run();

// 終了
exit;

?>
