<?php
/**********************************************************
* File         : index.php
* Authors      : sumio imoto
* Date         : 2013.07.01
* Last Update  : 2013.07.01
* Copyright    : 
***********************************************************/

//=================================
// 共通処理
//=================================
// 処理プログラム
require_once("mod/index.class.php");
//=================================
// 各処理後の表示HTMLファイル
//=================================
$aryHtml[1] = "view/index.tpl";

//=================================
// メイン
//=================================
// モード設定
if (@$_REQUEST["mode"] == "")
{
	$_REQUEST["mode"] = "input";
}

// 処理オブジェクト生成
$mgr = new index($_REQUEST);


// 処理開始
$ret = $mgr->run();

// 表示ファイル取得
$strHtml = $aryHtml[$ret];

// 画面表示
include_once($strHtml);

// 終了
exit;
?>
