<?php
/**********************************************************
* File         : dataExport.php
* Authors      : mie tsutsui
* Date         : 2013.01.29
* Last Update  : 2013.01.29
* Copyright    :
***********************************************************/

//=================================
// 共通処理
//=================================
// 処理プログラム
require_once("mod/data_export.class.php");

//=================================
// メイン
//=================================
$_POST["mode"] = "output";

// 処理オブジェクト生成
$mgr = new data_export($_POST);

// 処理開始
$ret = $mgr->run();

// 終了
exit;

?>
