<?php
/**********************************************************
* File         : printJunhis.php
* Authors      : sumio imoto
* Date         : 2013.05.29
* Last Update  : 2013.05.29
* Copyright    :
***********************************************************/

//=================================
// 共通処理
//=================================
// 処理プログラム
require_once("mod/users_edit.class.php");

//=================================
// メイン
//=================================

// モード設定
$_REQUEST["mode"] = "preJunhisIDPrint";

// 処理オブジェクト生成
$mgr = new users_edit($_REQUEST);

// 処理開始
$ret = $mgr->run();

// 終了
exit;

?>
