<?php
/**********************************************************
* File         : professionstatusChange.php
* Authors      : mie tsutsui
* Date         : 2013.02.08
* Last Update  : 2013.02.08
* Copyright    :
***********************************************************/

//=================================
// 共通処理
//=================================
// 処理プログラム
require_once("mod/ajax.class.php");

//=================================
// メイン
//=================================


// 処理オブジェクト生成
$mgr = new ajax('professionstatusChange', $_POST);

// 処理開始
$ret = $mgr->run();

// 終了
exit;

?>
