<?php
/**********************************************************
* File         : logout.php
* Authors      : mie tsutsui
* Date         : 2011.07.29
* Last Update  : 2011.07.29
* Copyright    : 
***********************************************************/


//=================================
// 共通処理
//=================================
// 処理プログラム
require_once("mod/index.class.php");

//=================================
// メイン
//=================================
// モード設定
$_REQUEST["mode"] = "logout";

// 処理オブジェクト生成
$mgr = new index($_REQUEST);

// 処理開始
$ret = $mgr->run();

// 終了
exit;
?>
